In [20]:
import pandas as pd

df = pd.read_csv("new_data.csv")
df

            id first_name  last_name              username         phone
0   5302516415        T19        NaN               bhankin  9.178499e+11
1   5325555902         T7        NaN           kaantozlama           NaN
2   5214494189        T11        NaN         peterpaolo222           NaN
3   1597954759        T27        NaN     castilian_Crinkly           NaN
4   1118956923        T20        NaN        manikandan9786           NaN
5    831569064        T15        NaN             nithinmaa           NaN
6    557839321         T8        NaN       SlimVeteran1990           NaN
7   7198448170         T3        NaN         Rosegoldingft           NaN
8   7232810247     Pretty        NaN                   NaN  2.541146e+11
9   7242137483        T24        NaN                WZxmVx           NaN
10  7259969112         T4        NaN                   NaN           NaN
11  7303455684        T29        NaN  Paseos_Phrenetically           NaN
12  7358897802         T1        NaN                   NaN           NaN
13  7398170945        T22        NaN             Dunks2050           NaN
14  7441878979        T25        NaN                lzFYry           NaN
15  7491230464        T26        NaN        AnticalTingler           NaN
16  6356209668        T28        NaN        Bathe_fiducial           NaN
17  6379900802        T21        NaN              singhdua           NaN
18  7117938500        T23        NaN                wXAoex           NaN

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19 entries, 0 to 18
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          19 non-null     int64
 1   first_name  19 non-null     object
 2   last_name   0 non-null      float64
 3   username    16 non-null     object
 4   phone       2 non-null      float64
dtypes: float64(2), int64(1), object(2)
memory usage: 892.0+ bytes